In [1]:
import pandas as pd

In [7]:
df=pd.DataFrame({"one":[1,2,3,4,5],
                "two":list('abcde'),
                "three":list('AAABB')})

In [8]:
df

   one three two
0    1     A   a
1    2     A   b
2    3     A   c
3    4     B   d
4    5     B   e

In [9]:
df['four']=1

In [10]:
df

   one three two  four
0    1     A   a     1
1    2     A   b     1
2    3     A   c     1
3    4     B   d     1
4    5     B   e     1

In [13]:
df_g=df.groupby('three')

In [35]:
import numpy as np
df_g.aggregate([sum, np.mean]).reset_index()

  three one      four
        sum mean  sum mean
0     A   6  2.0    3    1
1     B   9  4.5    2    1

In [41]:
df[['one','three']].groupby('three').aggregate(np.mean).reset_index()

  three  one
0     A  2.0
1     B  4.5

In [42]:
df[['one','three']].groupby('three').aggregate([sum, min, max]).reset_index()

  three one
        sum min max
0     A   6   1   3
1     B   9   4   5